Ran Plan for project: `sharedservices-prod` dir: `accounts/backstage-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.backstage will be updated in-place
~ resource "aws_db_instance" "backstage" {
        id                                    = "db-GT4A2ZQFCMZ5ICM2MTTWAUXT6Y"
        tags                                  = {
            "Name" = "backstage-db"
        }
      ~ vpc_security_group_ids                = [
          - "sg-0f7470bcd8eb04cfa",
        ] -> (known after apply)
        # (69 unchanged attributes hidden)
    }

  # aws_db_subnet_group.backstage will be updated in-place
~ resource "aws_db_subnet_group" "backstage" {
        id                      = "backstage-db-subnet-group"
        name                    = "backstage-db-subnet-group"
      ~ subnet_ids              = [
          - "subnet-06ea04da1d57590d6",
          - "subnet-0c2ce4fe6da96632e",
        ] -> (known after apply)
        tags                    = {
            "Name" = "backstage-db-subnet-group"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_ecs_cluster.backstage will be updated in-place
~ resource "aws_ecs_cluster" "backstage" {
        id       = "arn:aws:ecs:us-east-2:825765422855:cluster/backstage-cluster"
        name     = "backstage-cluster"
      ~ tags     = {
          + "Name" = "backstage-cluster"
        }
      ~ tags_all = {
          + "Name"       = "backstage-cluster"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.backstage will be updated in-place
~ resource "aws_ecs_service" "backstage" {
        id                                 = "arn:aws:ecs:us-east-2:825765422855:service/backstage-cluster/backstage-service"
        name                               = "backstage-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:825765422855:task-definition/backstage-task:1" -> (known after apply)
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "backstage" -> null
          - container_port   = 7007 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:825765422855:targetgroup/backstage-tg/352232bb606e0835" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "backstage"
          + container_port   = 7000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-0d60911e1d971624d",
            ] -> (known after apply)
          ~ subnets          = [
              - "subnet-06ea04da1d57590d6",
              - "subnet-0c2ce4fe6da96632e",
            ] -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.backstage will be created
+ resource "aws_ecs_task_definition" "backstage" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "APP_CONFIG_app_baseUrl"
                          + value = "https://backstage.feedutopia.com"
                        },
                      + {
                          + name  = "APP_CONFIG_backend_baseUrl"
                          + value = "https://backstage.feedutopia.com"
                        },
                      + {
                          + name  = "AWS_REGION"
                          + value = "us-east-2"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "POSTGRES_DATABASE"
                          + value = "backstage"
                        },
                      + {
                          + name  = "POSTGRES_HOST"
                          + value = "terraform-20250314161505980000000006.c1a2wycw0b5j.us-east-2.rds.amazonaws.com"
                        },
                      + {
                          + name  = "POSTGRES_PASSWORD"
                          + value = "ReallySecurePassword123!"
                        },
                      + {
                          + name  = "POSTGRES_USER"
                          + value = "backstage_user"
                        },
                      + {
                          + name  = "TECHDOCS_S3_BUCKET"
                          + value = "backstage-techdocs-feedutopia"
                        },
                    ]
                  + image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/backstage-repo:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/backstage"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "backstage"
                        }
                    }
                  + name             = "backstage"
                  + portMappings     = [
                      + {
                          + containerPort = 700
                          + hostPort      = 700
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::825765422855:role/backstage-ecs-execution-role"
      + family                   = "backstage-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "DeployedBy" = "Terraform"
        }
      + task_role_arn            = "arn:aws:iam::825765422855:role/backstage-ecs-task-role"
      + track_latest             = false
    }

  # aws_internet_gateway.igw will be updated in-place
~ resource "aws_internet_gateway" "igw" {
        id       = "igw-0878cda263c512630"
        tags     = {
            "Name" = "backstage-igw"
        }
      ~ vpc_id   = "vpc-0560cf8a4635173ce" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lb.frontend will be updated in-place
~ resource "aws_lb" "frontend" {
        id                                                           = "arn:aws:elasticloadbalancing:us-east-2:825765422855:loadbalancer/app/backstage-alb/da6d56c961fa9ce6"
        name                                                         = "backstage-alb"
      ~ security_groups                                              = [
          - "sg-0bb3a4008e0422e28",
        ] -> (known after apply)
      ~ subnets                                                      = [
          - "subnet-0068fa299aee4933b",
          - "subnet-0f18dca1f4cdce347",
        ] -> (known after apply)
        tags                                                         = {
            "Name" = "backstage-alb"
        }
        # (25 unchanged attributes hidden)

      ~ subnet_mapping (known after apply)
      - subnet_mapping {
          - subnet_id            = "subnet-0068fa299aee4933b" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-0f18dca1f4cdce347" -> null
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lb_listener.frontend_https will be updated in-place
~ resource "aws_lb_listener" "frontend_https" {
        id                                                                    = "arn:aws:elasticloadbalancing:us-east-2:825765422855:listener/app/backstage-alb/da6d56c961fa9ce6/78954eb6504a83f1"
        tags                                                                  = {}
        # (26 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:825765422855:targetgroup/backstage-tg/352232bb606e0835" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.backstage must be replaced
-/+ resource "aws_lb_target_group" "backstage" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:825765422855:targetgroup/backstage-tg/352232bb606e0835" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/backstage-tg/352232bb606e0835" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:825765422855:targetgroup/backstage-tg/352232bb606e0835" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-east-2:825765422855:loadbalancer/app/backstage-alb/da6d56c961fa9ce6",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "backstage-tg"
      + name_prefix                        = (known after apply)
      ~ port                               = 7007 -> 7000 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Name" = "backstage-tg"
        }
      ~ vpc_id                             = "vpc-0560cf8a4635173ce" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}

        # (1 unchanged block hidden)
    }

  # aws_nat_gateway.nat will be created
+ resource "aws_nat_gateway" "nat" {
      + allocation_id                      = "eipalloc-09291ea80dfe99917"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "backstage-nat"
        }
      + tags_all                           = {
          + "DeployedBy" = "Terraform"
          + "Name"       = "backstage-nat"
        }
    }

  # aws_route_table.private will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "backstage-private-rt"
        }
      + tags_all         = {
          + "DeployedBy" = "Terraform"
          + "Name"       = "backstage-private-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = "igw-0878cda263c512630"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "backstage-public-rt"
        }
      + tags_all         = {
          + "DeployedBy" = "Terraform"
          + "Name"       = "backstage-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.priv1 will be created
+ resource "aws_route_table_association" "priv1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.priv2 will be created
+ resource "aws_route_table_association" "priv2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.pub1 will be created
+ resource "aws_route_table_association" "pub1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.pub2 will be created
+ resource "aws_route_table_association" "pub2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.alb must be replaced
-/+ resource "aws_security_group" "alb" {
      ~ arn                    = "arn:aws:ec2:us-east-2:825765422855:security-group/sg-0bb3a4008e0422e28" -> (known after apply)
      ~ id                     = "sg-0bb3a4008e0422e28" -> (known after apply)
        name                   = "backstage-alb-sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "825765422855" -> (known after apply)
        tags                   = {
            "Name" = "backstage-alb-sg"
        }
      ~ vpc_id                 = "vpc-0560cf8a4635173ce" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.ecs must be replaced
-/+ resource "aws_security_group" "ecs" {
      ~ arn                    = "arn:aws:ec2:us-east-2:825765422855:security-group/sg-0d60911e1d971624d" -> (known after apply)
      ~ id                     = "sg-0d60911e1d971624d" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow Backstage port from ALB"
              - from_port        = 7007
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0bb3a4008e0422e28",
                ]
              - self             = false
              - to_port          = 7007
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow Backstage port from ALB"
              + from_port        = 7007
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 7007
            },
        ]
        name                   = "backstage-ecs-sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "825765422855" -> (known after apply)
        tags                   = {
            "Name" = "backstage-ecs-sg"
        }
      ~ vpc_id                 = "vpc-0560cf8a4635173ce" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.rds must be replaced
-/+ resource "aws_security_group" "rds" {
      ~ arn                    = "arn:aws:ec2:us-east-2:825765422855:security-group/sg-0f7470bcd8eb04cfa" -> (known after apply)
      ~ id                     = "sg-0f7470bcd8eb04cfa" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Postgres from ECS tasks"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d60911e1d971624d",
                ]
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = "Postgres from ECS tasks"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "backstage-rds-sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "825765422855" -> (known after apply)
        tags                   = {
            "Name" = "backstage-rds-sg"
        }
      ~ vpc_id                 = "vpc-0560cf8a4635173ce" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.private1 must be replaced
-/+ resource "aws_subnet" "private1" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:825765422855:subnet/subnet-0c2ce4fe6da96632e" -> (known after apply)
      ~ availability_zone_id                           = "use2-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0c2ce4fe6da96632e" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "825765422855" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "backstage-private-1"
        }
      ~ vpc_id                                         = "vpc-0560cf8a4635173ce" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # aws_subnet.private2 will be created
+ resource "aws_subnet" "private2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "backstage-private-2"
        }
      + tags_all                                       = {
          + "DeployedBy" = "Terraform"
          + "Name"       = "backstage-private-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public1 must be replaced
-/+ resource "aws_subnet" "public1" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:825765422855:subnet/subnet-0f18dca1f4cdce347" -> (known after apply)
      ~ availability_zone_id                           = "use2-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0f18dca1f4cdce347" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "825765422855" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "backstage-public-1"
        }
      ~ vpc_id                                         = "vpc-0560cf8a4635173ce" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # aws_subnet.public2 must be replaced
-/+ resource "aws_subnet" "public2" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:825765422855:subnet/subnet-0068fa299aee4933b" -> (known after apply)
      ~ availability_zone_id                           = "use2-az2" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0068fa299aee4933b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "825765422855" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "backstage-public-2"
        }
      ~ vpc_id                                         = "vpc-0560cf8a4635173ce" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:825765422855:vpc/vpc-0560cf8a4635173ce" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.0.0.0/16" -> "10.10.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-00a321c787758536f" -> (known after apply)
      ~ default_route_table_id               = "rtb-0824cc5cc8462d732" -> (known after apply)
      ~ default_security_group_id            = "sg-02fc697452002ed26" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-028ae4b506f5e1e20" -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0560cf8a4635173ce" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0824cc5cc8462d732" -> (known after apply)
      ~ owner_id                             = "825765422855" -> (known after apply)
        tags                                 = {
            "Name" = "backstage-vpc"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 17 to add, 7 to change, 8 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fbackstage-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 17 to add, 7 to change, 8 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```